{
  "architectures": [
    "ByteGPT"
  ],
  "model_type": "bytegpt",
  "hidden_size": 384,
  "num_hidden_layers": 6,
  "num_attention_heads": 6,
  "num_key_value_heads": 6,
  "head_dim": 64,
  "intermediate_size": 1536,
  "max_position_embeddings": 256,
  "vocab_size": 256,
  "hidden_act": "gelu",
  "norm_type": "layernorm",
  "position_embedding_type": "learned",
  "tie_word_embeddings": false,
  "torch_dtype": "bf16"
}